using System;
using System.Collections.Generic;

namespace sugoroku.prg
{
    public class Common
    {
        public static readonly int c_FinishCell = 45;

        public static readonly Dictionary<int, string> d_Event = new Dictionary<int, string>()
        {
            {1,"おっはモーニング。\r\nおはようの一杯" },
            {3,"喉が渇いた、とりあえず飲む" },
            {4,"偶然電車で見かけたあの娘に恋に落ちる。\r\n1杯飲む" },
            {5,"令和のパリピ代表に俺はなる！" },
            {6,"天気がいいので\r\nとりあえず飲む" },
            {7,"気になるあの娘と初デート\r\nとりあえず飲む" },
            {8,"もしかしてマジシャン？\r\n目の前の酒が消える" },
            {9,"福利厚生に酒ありますか？と聞いたら落とされた\r\nやけ酒" },
            {10,"突然、実家に帰ることになった。\r\n振り出しに戻る" },
            {12,"気になるあの娘が終電を逃した？\r\n今夜はパーチーだ\r\n誰か2人を指定してそれぞれ2杯飲む" },
            {13,"3分間語尾ぴえん（忘れるたびに1杯）" },
            {14,"もしかしてマジシャン？\r\n目の前の酒が消える" },
            {15,"理由はないけど全員で乾杯！" },
            {16,"木を揺すったら酒が落ちてきた" },
            {18,"気になるあの娘をデートに誘った\r\n気合いをいれるために乾杯" },
            {19,"もしかしてマジシャン？\r\n目の前の酒が消える" },
            {20,"あれ、これって全部夢だったの？\r\nスタートに戻る" },
            {21,"酒に呼ばれてる気がする" },
            {22,"気になるあの娘とデート当日\r\n誰か1人を指定して代理飲み" },
            {24,"理由はないけど全員で乾杯！" },
            {25,"気になるあの娘が好意あるのかわからなくて病む\r\nいっぱい飲む" },
            {26,"もしかしてマジシャン？\r\n目の前の酒が消える" },
            {28,"告白の返事がこない\r\nやけ酒" },
            {29,"喋る前に飲む！" },
            {30,"突然、実家に帰ることになった。\r\nスタートに戻る" },
            {31,"漢なら飲む！" },
            {32,"気になるあの娘から大切な人になった\r\nお祝いで全員で祝杯" },
            {33,"もしかしてマジシャン？\r\n目の前の酒が消える" },
            {35,"リア充は飲みたりてないんじゃないの？？" },
            {36,"酒に呼ばれてる気がする" },
            {38,"もしかしてマジシャン？\r\n目の前の酒が消える" },
            {39,"天気がいいので\r\nとりあえず飲む" },
            {40,"ゴールが近くなった寂しいから\r\nスタートに戻る" },
            {41,"おっそモーニング\r\n目覚めの1杯" },
            {42,"もしかしてマジシャン？\r\n目の前の酒が消える" },
            {43,"酒に呼ばれてる気がする" },
            {44,"喉が渇いた、とりあえず飲む" },
            {45,"ゴール！！！！！" }
        };
    }
}
